# SetViewDisplayModel Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..SetViewDisplayModel Method
View Class See Also
---
Sets the view display model settings for the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void SetViewDisplayModel(
	ViewDisplayModel viewDisplayModel
)
```

Visual Basic
---
```text
Public Sub SetViewDisplayModel ( _
	viewDisplayModel As ViewDisplayModel _
)
```

Visual C++
---
```text
public:
void SetViewDisplayModel(
	ViewDisplayModel^ viewDisplayModel
)
```

# ### Parameters
viewDisplayModel
    Type: Autodesk.Revit.DB..::..ViewDisplayModel View display model settings to set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The silhouette line style id is not a valid line style to apply to the view. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This view does not contain display-related properties. |

# See Also
View Class
Autodesk.Revit.DB Namespace